const express = require('express');
 app = express();

 app.listen(() => console.log('done !'));

 app.use('/ping', (req, res) => {
     res.send(new Date());
 }); 

setTimeout(() => {
  if (!client || !client.user) {
    console.log("Client Not Login, Process Kill")
    process.kill(1);
  } else {
    console.log("Client Login")
  }
}, 3*1000*60);

const Discord = require('discord.js');
const { Client, MessageActionRow, MessageButton, Modal, MessageButtonStyle, TextInputComponent, TextInputStyle, Permissions } = require('discord.js');
const client = new Discord.Client({ intents: [new Discord.Intents(32767)] });
const { Intensts, MessageEmbed, Collection, Collector, Formatters, MessageSelectMenu, Intents, MessageAttachment } = require('discord.js');
var cooldown = new Set()
const { ButtonBuilder, ButtonStyle, Events, ActionRowBuilder } = require('discord.js');
const mongoose = require("mongoose");
const nodeevent = require('node:events');
const ms = require("ms")
const moment = require("moment")
const guild = require('guild');
const request = require('request');
const prefix = "-"  
const wait = require('node:timers/promises').setTimeout;

const line = ""; // رابط خطك

//

client.login(process.env.token)


client.on("messageCreate", async interaction => {
if (interaction.content.startsWith(prefix + 'Sul6an-sam')){
  let embed = new Discord.MessageEmbed() 
      .setTitle("**𝗥𝘂𝗹𝗲𝘀 𝗦𝗲𝗿𝘃𝗲𝗿 𝗛𝟳 𝗥𝗽 ™ **")
      .setColor("#BA271A")
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(`${interaction.guild.name} |  Rules Server`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(`__** جميـع القـوانيـن التابـعه لسيـرفر 

> H7RP™ 

اي قـانون يخـالف سيتـم المحاسـبه من قبـل الاداره وشكـراً .
**__ `)
   .setTimestamp()
  .setImage("https://media.discordapp.net/attachments/1016738163072450620/1169032683351969843/BCA8DF0B-F117-4988-AD08-FDD69FD1B2A0.jpg?ex=656f9d07&is=655d2807&hm=2d216f9fb9cb3dd3e62d0baaf10b03151237faa4ff64999e5b840e56ac194f8b&")
   .setFooter(`Developer Development For H7 Rp `, 
interaction.guild.iconURL({dynamic:true})) 

  
const menu = new MessageActionRow()
    .addComponents(
      new MessageSelectMenu()
                    
         .setCustomId('menu_guide') 
         .setPlaceholder('إختر إحد اللوائح للقراءة .')

         .addOptions([
                      
                        {
             label: '𝗗iscord 𝗥ules',
                              description: ' ',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'First_Law',
                        },
                        {              
                      
             label: '𝗚eneral 𝗥ules',
                              description: '',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'Second_Law',
                        },      
             {              
                      
             label: '𝗚angs 𝗥ules',
                              description: '',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'third_Law',
                        },      
             {              
                      
             label: '𝗖ity 𝗟anguage',
                              description: '',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'Fourth_Law',
                        },      
             {              
                      
             label: '𝗥p 𝗥ules',
                              description: ' ',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'Fifth_Law',
                        },      
             {              
                      
             label: '𝗦afe 𝗔reas',
                              description: '',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'Sixth_Law',
                        },      
             {              
                      
             label: '𝗚mc 𝗥ules',
                              description: ' ',
             emoji: `<:2_Paper:1134085833356492800>`,
             value: 'Seventh_Law',
                        },      
                    ]),
        );
    interaction.channel.send({
      embeds: [embed], components: [menu]}).then(m => {
      interaction.delete()
      })
}
}) 
client.on("interactionCreate", async interaction => {
    if (!interaction.isSelectMenu()) return;

  let embed1 = new Discord.MessageEmbed() 
      .setTitle("**𝗗iscord 𝗥ules**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} | 𝗗iscord 𝗥ules`,interaction.guild.iconURL({dynamic:true}))     
.setDescription(`「1」يمنع الإعتداء اللفظي
يشمل كل انواع الاساءة اللفظية كالشتيمة ・ السخرية ・ العنصرية ・ التجريح


・「2」التعدي على مجموعة او فئة (:
يشمل اي لفظ او سياق حديث يتعرض بالإساءة لمجموعة من الناس مهما كان سياق الموضوع ديني او حزبي او سياسي , و غيره من المواضيع التي لا يكون الهدف منها شخص بعينه بل مجموعة كبيرة من الناس و يكون مصير المخالفة بهذا القانون هو الحظر المباشر من دون أي تحذير لما يولده هذا النوع من الحديث خلافات بين مجموعات كبيرة من الأعضاء الأمر الذي قد يؤدي الى فقد السيطرة في حال لم يتم التعامل معه بهذه الطريقة


・「3」يمنع التهديد عبر الانترنت
يشمل التهديد بالاختراق・التهديد بالحاق الضرر بعضو آخر・نشر معلومات خاصة بعضو اخر・او اي وسيلة اخرى يمكن استخدامها لتهديد او ايذاء شخص من اعضاء هذا المجتمع


・「4」مراعاة تنوع الأعمار
يحتوي هذا المجتمع على أشخاص من جميع الفئات العمرية・و وجود أعمار صغيرة يحتم علينا إبقاء الحديث في حدود مناسبة لجميع الأعمار


・「5」يمنع مضايقة الأعضاء
يحتوي هذا المجتمع على أعضاء بمستويات مختلفة منها المتقدم و منها المبتدئ・يمكنك تقديم النصيحة لأي شخص مع الحرص على عدم مضايقة العضو بالإستهزاء منه او التقليل من شأنه 

__**
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__`)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true})) 

let embed2 = new Discord.MessageEmbed() 
      .setTitle("**𝗚eneral 𝗥ules**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} | 𝗚eneral 𝗥ules`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(`- تعريف الحياة الواقعية 


 يجب عليك تقمص الشخصية داخل  الرول بلاي سواء كانت شخصيتك محامي عسكري عصابة مواطن سواء شاب او رجل مسن

- تعريف تقدير الحياة 

يجب عليك تقدير موقفك في اي حالة كنت متواجد فيها 

 القوانين العامة 

1. يمنع التواصل الغير شرعي " Meta Gaming “

2. ممنوع استخدام المركبة ك سلاح " VDM "

3. ممنوع القتل العشوائي " RDM “

4. في حال تم اسقاطك يمنع عليك التحدث ويمنع تذكر اي شي قبل اسقاطك الى في حال احد ذكرك و تذكر اخر 10دقايق فقط . وحين مرور 5 دقايق بعد انعاشك و بدون تذكير يسمح اذكر 5 دقايق قبل موتك  " NLR “

5. عدم الخوف بشكل واقعي على حياتك عندما تتعرض بالتهديد بالاسلحة أو ب اشياء اخرى , مثال اذا يوجد اداة تعرض حياتك للخطر " NVL “

6. الحفاظ على حياتك وحياة الأخرين , وعدم التهور وأن لا تستهين بقتل الاشخاص , وأن لا تقاوم اي شخص يحمل سلاح مهما كان خصوصاً اذا كنت بروحك " تقدير الحياة " 

7. يجب بناء كركتر خاص فيك وتقمصه بشكل ممتاز بالاقوال و الافعال 

8. يمنع اهانة الشخص المسقط بأي حال من الاحوال 

9. يمنع تقليد ملابس الشرطة و الوظائف 

10. يمنع الخروج عن الرول بلاي داخل السيرفر لأي سبب من الاسباب 

11.  في حال اسقطت يحق لك التحدث عن الالم فقط ويمنع التحدث الطبيعي 


13. يمنع اي اتفاق خارج الرول بلاي ويعتبر ميتا قيمنق 

14. يجب تشغيل التصوير في حال بدء اي سيناريو فايت سرقة الخخ  ويجب حفظه و بعد  24  ساعة من القيم يسمح حذفه " تجنب اي شكوى لك "

15. يمنع التدخل في سيناريو قائم 

16. الشخصنة ممنوعه منعاً باتاً بجميع انواعهاً

17. يمنع ترابط الشخصيه الاولى مع الثانيه 

18. ممنوع الكلام المشفر 

19. يمنع الخروج من السيرفر اثناء السيناريو

20. يجب عليك اخذ جميع المواقف الجدية بشكل جدي مثال : عسكري او محامي او مواطن 


22. في حال تحللت يجب عليك نسيان المتسبب بموتك

23. التعرف على الشخص يكون عن طريق الشكل ويمنع التعرف عليه من صوته 

24. يجب عليك ان تقدر حياتك والخوف على نفسك في حالة تم تهديدك وليس لديك الاستطاعة على المقاومة . بمعنى ان تكون مسلح وامامك 2 مسلحين وأيضاً يمنع مقاومة السلاح الابيض في حال كنت اعزل

25.  يمنع التلويت بأي شكل من الاشكال ويمنع اخذ الاغراض بغرض الخوف على الحياة بمعنى اصح يمنع التلويت .

26. يمنع التربص للموظفين الحكوميين وانتظار الشخص عند مقر الوظيفة او نقاط التوقف

27. في حال فقدان اربع ايطارات ( كفرات ) من المركبة يمنع استكمال قيادتها 

28. يمنع منعاً باتاً طلق النار اثناء ركوب المركبه او القيادة . 

29. يحق للشخص بتكوين عداوة بشكل مباشر في حال النصب و الاحتيال ولا يلزم وجود 3 مواقف عداوة

30. يمنع منعا باتا تلويت العسكري ايضا يمنع خطف العسكري وهو مسقط الا في حال وحدة في حال رفعتوا علية السلاح وقلت لة سلم نفسك وقاوم يحق لك تخطفة وهو مسقط .

31. يجب وضع التصوير مدته ( 1h ) كاملة لضمان حقك في حال  طلب التصوير منك 

32. طريقة الاغماء : تكون بسبب مدني ذبحك او احد عطاك كف ( فجرت نفسك احد فجرك طحت من فوق مبنى عالي مثل مبنى قيد الانشاء و غيره )

• في حال جاتك حالة الاغماء يجب عليك الانتظار لمدة 30 ثانية و بعدين تذبح نفسك و تتحرك 

33. طريقة التحلل : تكون في حال اشخاص اسقطوك و سحبو عليك او نسو ينعشونك في مال الاشخاص متواجدين ب الموقع يمنع التحلل كذالك يمنع عليك التحلل في حال الاشخاص ركبوك السيارة و يبون يودونك المستشفى 

• التحلل  لازم يمر  على اسقاطك 3 دقايق اقل شي 

• في حال التحلل يجب عليك ازالة جميع الاشياء التي تخص عالمك المتحلل .  


35. يمنع نقل الاموال و الاغراض بين الشخصيات منعاً باناً  


37. يمنع اخذ حبة VIP 

38. يمنع كثرة الفايتات و في حال لاحظنا شخص يتفايت على كل كبيرة و صغيرة سيتم التعامل معاه 

39. الي يلفت وهو مسقط سيتم التعامل معاه + يجب دليل انه طلعك من اللعبة او فصل النت او غيرها وفي حال العطرة مقبول سيتم المسامحة 

40. جميع الاسلحة الثقيلة ماترفعها الا في حال رفع عليك عسكري سلاح ثقيل + ترفعه بسبب مقنع 

41. يمنع عليك تستخدم شي مو معاك ب الحقيبة وفي حال صدناك لاتقول بلغلط وغيرها. 

42. يـمنع سـواقـة المـركبه بطـريقه غيـر واقـعيه والقـفز باماكن عـاليه قـد تعـرضك للخـطر ويـجب السـواقه ان تكـون واقـعيه وتقـديـريه لـانهـا احـد قـوانين ( LAR )

43. يمنـع عليك فـي حـال خطفـت شخـص اخذ الفلـوس المتواجده فـي البنك ايضـاً يمنـع اخـذ اكثـر من 2000

44. يمنع عليك منـعاً باتاً ابقاء الرهنيه معك اكثر من 20 دقيقه . 

45. يمنع تصوير الرهينه ايضاً يمنع تصوير الشخص المسقط . 

46. يمنع عليك بيع او شراء اي سيارة الا عن طريق معرض السيارات المستعملة
__**
يتم تعديل القوانين من وقت الى اخر -<a:43:1086723332793188394> **__`)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true})) 

let embed3 = new Discord.MessageEmbed() 
      .setTitle("**𝗚angs 𝗥ules**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} | 𝗚angs 𝗥ules`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(` - تعريف الاجرام 


 يجب عليك قياس وضعك بالحياة الواقعية عند الاجرام او كنت مخطوف ، بالقوه او الخوف .

 قوانين الاجرام 

1. يمنع مقاومة السلاح الابيض في حال عدم وجود اي سلاح في اليد ، ايضا يمنع مقاومة السلاح الناري بالسلاح الابيض .

2. يجب على المواطن المخطوف تقمص شخصية الرهينه .

3.  في حال خطف الرهينة يجب على الخاطف التوجه الى مكان التفاوض في اسرع وقت ممكن وعدم اطالة علمية الخطف .

4. اذا خطفت المواطن واصبح رهينة ، لديك 20 دقيقه فقط لبداية تنفيذ السيناريو وفي حال تم تخطى المدة ولم تبدا السيناريو يجب عليك اطلاق سراح الرهينه .

5.  يجب ان يكون التهديد بشكل مباشر حيث لايمكنك التهديد وانت داخل المركبه .

6. يمنع اهانة الرهينه بأي شكل من الاشكال سواء بالاقوال او الافعال .

7. يمنع منعاً باتاً كلبشة اي شخص قبل استسلامه لك ورفع يديه .

8.  يحق الرهينه الهروب من المكان في حال وجود فرصه للهروب او في حال عدم انتباه الخاطفين او ستغفالهم .

9. في حال تم تهديد المواطن و انصاع لاوامرك لا يحق لك قتله تحت اي ظرف كان ، في حال عدم الانصياع و محاولة المقاومه يحق لك قتله .


11. الحد الاقصى لطلب فدية تحرير رهينة واحده هي 3500$ ويكون التسلم يداً بيد .

12. لايحق للمجرمين قتل الرهينه اذا تم التعاون من قبله او من قبل الشرطه .


14. يمنع منعاً باتاً الاعتداء على مفاوض الشرطه كما يمنع التفاوض على رهينه ليست في موقع الجريمه .

15. يمنع الاتفاق مع الرهينه .

16. يجب على المجرم الحفاظ على الرهينه وعدم قتله لاسباب شخصية او بسبب " تافه " لابد ان يكون سبب مقنع ويستاهل القتل .

17. حد افراد العصابه داخل السيرفر 10 اعضاء .

18. يمنع تحالف العصابات ضد الشرطه او ضد عصابه اخرى .

19. يمنع الاعتداء على مفاوض الشرطه في السيناريو ويمنع الاعتداء على مفاوض المجرمين .


21. يمنع تقليد ملابس العصابات .


23. لايسمح بأطلاق النار العشوائي او بغرض جذب الشرطه .

24. يمنع الاجرام كالخطف و السرقات بمركبات المخصصه للوظائف كالتكسى و السطحات وغيرها .

25. يجب عليك ارتداء القناع فالسرقات تجنب إدراجك في قائمة المطلوبين .

26. يحق للشخص تكوين عداوة في حال النصب ولا يلزم وجود 3 مواقف سابقه .

27. يمنع افتعال فايت دون سبب .

28. يمنع عليك ك لاعب فالسيرفر المحاولة في تسبب اي عداوة بهدف الشخصنه او التلويت و القتل و استخدام السلاح .. العداوة تأتي بعد 3 خلافات داخل الـ RP .

29. لاتعتبر الرهينه مخطوفه في حال عدم تقيدها ويحق له الهروب في حال عدم انتباه الخاطفين . 

30. يمنع الاحتماء والاستفزاز وبيع الممنوعات في المناطق الامنه " كمثال شخص هددك يمنع عليك التوجه لأي منطقه امنه بأستثناء مركز الشرطه .

31.  يمنع في حالة الاستيقاف المروري خطف العسكري .

1. يمنع التعاون بين العصابات في الحرب ضد العصابة أو الشرطة ويسمح الصلح بين العصابتين و الاتفاقيات بينهم فالاعمال والسرقات فقط وليس للفايت .

2. في حال دخول شخص لمنطقة العصابات من دون سبب يتم اخذ مبلغ من الشخص " الكاش فقط " وان لم يتجاوب معك يحق لك تهديده وسرقة الكاش منه فقط ، الا لموظفين الوظائف الحكوميه لا يحق لأي عصابه التدخل فيهم الا في حال الاستفزاز .

3. في حال كثرت المخالفات على اعضاء العصابه يتم اعطاء تحذير من مسؤول العصابات و ايقاف العصابه للمره الاولى وفي حال المره الثانيه يتم اقفال العصابه ، ايضاً في حال تغيب العصابه عن السيرفر سيتم استبعادها .

4. كل عضو في عصابه يمثل العصابه بأكملها .

5. يمنع استخدام الاسلوب الجاف مع رجال الشرطة  ويمنع المصطلحات الغير لائقه بعد الانتصار في حال تم مخالفة هذا القانون يتم ايقاف العصابه لفتره معينه ويتم اعطاءها سترايك أول .

6. يمنع انتحال او تقليد ملابس عصابه اخرى .

7. يسمح بالتعاون عصابه مع عصابه اخرى بالسرقات كحد اقصى 6 كعدد الكلى للعصابتين . 

8. العدوات بين العصابات يجب ان تكون بسبب مقنع وفي حال وجود قتال بين عصابتين يمنع تدخل اي عصابه اخرى او تدخل عضو من عصابة اخرى .

9. عند محاولتك استفزاز العصابة بمنطقتها ستكون المسؤول عن اي مشكله تحدث بعد ذالك والشرطة تخلى مسؤوليتها من اي حدث داخل مناطق العصابات .

10. يحق للعصابه الدفاع عن ممتلكاتهم او مقرهم في حال وجود مداهمة عسكريه . 

11. في حال السرقات يجب على العصابه ارتداء الزي الرسمى وذالك لاثبات نفسهم .

12. يسمح لافراد الشرطة المشاركة في حرب العصابات في حال وجود 8 وحدات فأكثر .

13. العداوات تبنى على اكثر من موقف وليس من موقف واحد فقط .



 __**  
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__`) 
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true})) 

let embed4 = new Discord.MessageEmbed() 
      .setTitle("**𝗖ity 𝗟anguage**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} | 𝗖ity 𝗟anguage`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(`لغات السيرفر : 

1. طلع من القيم = سافر

2. ملقلق = مصدع او عندي صداع

3. الدسكورد = برنامج الدولة 

4. مايك = حنجرتك او مشكل بالحنجره

5. قلتش = سحر اسود 

 6. بروح وبجي او مأفك = غفوى او باخذ غفوى 

7. تدمجت = جتني اصابه

8. مت او قتلك = اصابني

9. اول قيم لي بالسيرفر = اول رحلة لي بالمدينة 

10. قفل مايكك = سكر حنجرتك او  اسكت

11.  قيم = رحلة

12. بطلع من الرحله = بروح انام 

13. الايدي = رقم الجوال 

14. روم = تطبيق او غرفة

15. الشركه ، موترسايكل " = موجه 

16. تتش باد =  عضلة  مثال - افتح التتش باد افتح الانضمه

17. في شخص مخرب = شخص مو محترم 

18. شخص مو موجود ب السيرفر = ارهابي

19. اولوية = حرارة  

20. بحول كركتر = بحول عالم 

21. السيرفر بيتقفل او قفل = اعصار

__**
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__`)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true})) 

let embed5 = new Discord.MessageEmbed() 
      .setTitle("**𝗥p 𝗥ules**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} 𝗥p 𝗥ules`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(`توضيح قوانين “ Rp " 

1. يمنع سرقة مركبات عسكر بمثال هليكوبتر عسكرية او دباب او سيارة 

2. يجب عليك قراءة التعليمات وفهمها وفي حال مخالفتك لها تتعرض للمسائلة بعقوبة  مشدده

 3. مراكز الشرطة والمستشفيات والمحكمة تعتبر محمية بموجب القانون ويمنع منعًا باتًا الأعمال الاجرامية بداخلها مثال الذبح , الضرب , الطلق , الخطف . أو خارجها ( بالقرب منها) ولا يسمح بالاحتماء فيها ما عدا مركز الشرطة .  


4. عند تقييدك من قبل الشرطة يجب عليك اتباع توجيهات الشرطي , و في حال عدم وجود عناصر شرطة بالمكان أو لم يكن منتبه لك او نزل سلاحه تستطيع الهروب .

5. عند حدوث اعادة تشغيل للسيرفر وكنت تحت رهن الإعتقال يجب عليك الرجوع وتسليم نفسك لمركز الشرطة .

6. لا يمكنك سرقة المركبات من الآخرين في الوقت الذي يتم فيه استيقافه من قبل الشرطة .

7. اعطائك خادم والخخخ او سيتم محاسبتة في دستور الدولة .

- يمنع الخروج عن الرول بلاي .

- يمنع عليك الطلق بشكل عشوائي الى  بغرض خطف او اسقاط الخ .

- يجب عليك في حال اردت الخطف ان تكون بمكان لايتواجد به احد واذا تواجد فيه احد يجب عليك الهروب او التهديد لأجل ان يبتعد من الموقع .

- اذا شافك واحد و انت بتخطف يجب عليك الهروب او تهديد الاشخاص الي يشوفونك بانهم يحركون من الموقع .

- يوم بتخطف تقوله ارفع يدك في حاله تبي ترفع يدك لازم انك تحط الرقصة الي اسمها surrender واجب عليك تجهزها عشان اذا احد بيخطف او عسكري يمسكك تكون جاهزه ,, ( ملاحظة في حال الشخص لم يرفع يده يمنع عليك كلبشته الى بعد 30 ثانية )  .

- في حال شخص قتلك ممنوع تتكلم او تقول اي شي مثال " تراك مخالف ليه ماسلمت نفسك " تعلق على اي شي ممنوع في حال مت بس تقول بالراديو ان تم اسقاطك وتسكت بعدها وماتذكر شي لين احد يذكرك .

• يمنع عليك دخول اي سجن وتهريب اي شخص او دخول مكان حكومي من دون اذن من الشرطه ,, يمنع عليك التحلل  في السجن و في حال كنت مسقط و لحد الان لم ينعشونك و دخلوك السجن تقعد تنطر ينعشونك , في حال صارت لك حالة اغماء وانت كنت في السجن ترجع مباشرةً للسجن 

• يجب عليك انا تماشي مع الرول في طلب المسعف سواً عصابه او عسكري 

- يمنع عليك الذهاب من منطقه غير امنه الى امنه بغرض النجاءه من اي طلق او خطف او الخ وفي حال ذهبت من منطقة غير امنه الى امنه يسمح لهم بطلق النار او خطفك,,  يسمح للمطارد الطلق او الي يبي يخطفك 

- يسمح لك الاعدام من دون اي اعلان وفي حال بتعدم يكون بسلاح ابيض او ناري ويجب بالسلاح الابيض تكون اكثر من ٥ طعنات والسلاح الناري ٣ طلقات على الرأس للاعدام  ويكون الاعدام بسبب مقنع لتجنب التحذيرات والباند ..

• يجب عليك شراء حقيبه في #﹝كاشير・ايكيا﹞〢🛒 ( بقيم ) قبل التجميع وغيرها 

• ممنوع تختار شخصية بنت وانت ولد والعكس صحيح 

• يمنع عليك استخراج مركبة بدون استمارة

 __** 
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__`)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true}))   

 let embed6 = new Discord.MessageEmbed() 
      .setTitle("**𝗦afe 𝗔reas**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} 𝗦afe 𝗔reas`,interaction.guild.iconURL({dynamic:true}))     
   .setDescription(`

 ** Safe Areas In <:2_:1169644550634098729> : <#1177717874631131296> **
 
__**   
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__`)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp.`, interaction.guild.iconURL({dynamic:true})) 

  let embed7 = new Discord.MessageEmbed() 
      .setTitle("**𝗚mc 𝗥ules**")
      .setColor("#BA271A") 
    .setThumbnail(interaction.guild.iconURL({dynamic:true}))
    	.setAuthor(` ${interaction.guild.name} 𝗚mc 𝗥ules`,interaction.guild.iconURL({dynamic:true}))
   .setDescription(`
【قوانين٠الجمس٠الاسود〡】

1- اذا جاك الجمس تركب معاه و تطلع من الراديو حقك

2- ممنوع الطقطقة مع الجمس تصل للباند <a:al8m:934595755056975902> 

3- ممنوع تكذب على الجمس الاسود ⚠️ 

4- ممنوع تقاطع الجمس

5-  ممنوع ترفع صوتك و انت راكب الجمس

#الجمس الاسود

 يمنع التعرض للجمس بأي شكل من الاشكال (الادمن) الي بيجيك راكب جمس اسود في حال وجود مخالفة رول بلاي وايضاً يمنع التفاعل معه الا في حال طلب منك


https://cdn.discordapp.com/attachments/1073760291906658426/1073779205323636806/493314-Grand_Theft_Auto_V_Screenshot_2019.04.16_-_08.13.44.01.png


قانون الجمس الاسود 

في حال شفت احد يخالف و تبي تطلب الجمس يمنع عليك تقول بطلب الجمس او حتى تلمح له ب شي اطلب بدون ماتقول شي  و يجيك الجمس الى مكانك 



طـلـب الـجـمـس

 - اي شخص راح يطلب جمس في وسط سيناريو او مسقط والي أسقطك جاك وتقوله طلبت جمس راح تنقلب الشكوى عليك و العقوبة تجيك 

__**
- يتم تعديل القوانين من وقت الى اخر <a:43:1086723332793188394> **__ `)
   .setTimestamp()
   .setFooter(`Developer Development For H7 Rp .`, interaction.guild.iconURL({dynamic:true})) 

if (interaction.customId === "menu_guide"){
  
    if (interaction.values[0] === 'First_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed1], ephemeral:true})
} 
  
if (interaction.values[0] === 'Second_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed2], ephemeral:true})
}

if (interaction.values[0] === 'third_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed3], ephemeral:true})
}

  if (interaction.values[0] === 'Fourth_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed4], ephemeral:true})
}
  
if (interaction.values[0] === 'Fifth_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed5], ephemeral:true})
}   

if (interaction.values[0] === 'Sixth_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed6], ephemeral:true})
}

if (interaction.values[0] === 'Seventh_Law'){
 interaction.reply({contnet:`For While.`, embeds: [embed7], ephemeral:true})
}  
   } 
});

client.on('ready', () => {
console.log(`Logged in as ${client.user.tag} Online`);
client.user.setActivity('H7-RP .', { type: 'PLAYING' })
client.user.setStatus("dnd");
});

client.on('messageCreate', async (message) => {
  if (message.content === prefix + 'سيرفر') {
    message.delete()
    const embed = new MessageEmbed()
      .setColor('#BA271A')      
   .setDescription('قوانين السيرفر') 
    	.setAuthor(`H7 RP`)
      
.setThumbnail(``)

.setImage(``)
.setFooter(`H7 RP`)
    const buttonRow = new MessageActionRow()
      .addComponents(
          new MessageButton()
          .setLabel('Server developers')
          .setStyle('LINK')
      .setURL('https://discord.gg/h72')
      .setEmoji('<:emoji_178:1151477392485912656>'),         
      );

    await message.channel.send({ embeds: [embed], components: [buttonRow] });
  }
});
